[{"Title":"Dawg Coffee","Url":"students.washington.edu/jamesp21/info343/dawg-coffee","Description":"The purpose of this website is to display information about coffee. It has a few features of the navigation bar and hyperlinks. Also, it adjust/change its content depending on the size of the screen that is being shown. The last thing I added was the 3 columns of information such as store hours, location, and contact information."},
{"Title":"Police Shooting","Url":"students.washington.edu/jamesp21/info343/police-shooting","Description":"This project takes data about victims of police shootings from the United states and displays them as colored circles on top of a map depending on if they were killed or not. Within these circles contain the information about the specific person and the report. It also keeps track of the gender and race then displays them in a specific way."},
{"Title":"Movie Review","Url":"students.washington.edu/jamesp21/info343/movie-review","Description":"This project consist of a movie being reviewed by people who has seen the movie and updates by  displaying the average ratings of the movie, made by all users, using stars. Also, a user who is reading the reviews can decide if a review was helpful or not by clicking thumbs up or thumbs down."},
{"Title":"Spotify Template","Url":"students.washington.edu/jamesp21/info343/spotify-template","Description":"This website is supposed to use a search query to retrieve artists songs, albums, album images, and popularity to display when the user chooses to play the current song or not. There is also a temporary build your own playlist option that would display the same information. When the user clicks the album image, it enlargers and plays the song until it is either clicked again or the sample reach its 30 seconds. Also, cool features such as background of storm and the transition of the spotify icon from one end of the screen to the next."},
{"Title":"Babel Collab","Url":"students.washington.edu/jamesp21/info343/babel-collab/babel-collab","Description":"The purpose of this project was to take a website, which served as a platform for research in scholaraly article recommendations, that displayed data in a static way, to categorizing articles in general subgroups and displaying them through a loop of circles."}]